{
  "hero.greeting": "Hi, I'm",
  "hero.name": "Juan Catena",
  "hero.role": "Backend Developer",
  "hero.viewProjects": "View Projects",
  "hero.downloadCV": "Download CV",
  "about.title": "About Me",
  "about.tagline": "Java backend focused on building real, maintainable systems",
  "about.photoAlt": "Photo of Juan Catena - Backend Developer",
  "about.intro": "I’m Juan Catena, a backend developer specialized in Java and Spring Boot. I design and build APIs, business logic and internal systems meant to run in production.",
  "about.experience": "I work with relational databases, access control, validations and business rules focused on solving real-world company problems.",
  "about.fullstack": "When the project requires it, I also build functional frontends with React and Next.js to deliver complete full-stack solutions.",
  "about.points.architecture": "Clear, domain-oriented architecture",
  "about.points.quality": "Maintainable code and explicit business validations",
  "about.points.production": "Production-first mindset from the initial design",
  "about.points.learning": "Continuous learning focused on backend and systems",
  "projects.springtrip.title": "SpringTrip — Full-Stack Application (Java + Spring Boot + Next.js)",
  "projects.springtrip.desc": "Full-stack application for managing group trips and shared expenses. Features JWT-based authentication, user-level access control, automatic balance calculation, and settlement generation. Backend built with Java 21 and Spring Boot, frontend developed with Next.js and deployed to production.",
  "projects.title": "Projects",
  "projects.demo": "Demo",
  "projects.webstihl.title": "STIHL Official Dealer Website",
  "projects.webstihl.desc": "Professional corporate website for an official STIHL service dealer. Built with Next.js, TypeScript and Tailwind CSS using a fully static architecture (SSG) with route-based i18n. Designed to reflect a real physical business model, focusing on services, product guidance and in-store assistance rather than e-commerce. Deployed to production with a custom domain.",
  "projects.todomotor.title": "Todo Motor",
  "projects.todomotor.desc": "A themed blog about cars and motorcycles built with Django and Bootstrap 5. Includes a post system with categories, search function, admin panel and fully responsive design.",
  "projects.scenra.title": "Scenra App",
  "projects.scenra.desc": "Interactive web app built with React, TypeScript and Vite that allows users to explore movies and series, view trailers, cast, and create custom lists. Inspired by streaming platforms and powered by the TMDB API.",
  "projects.travelsplit.title": "TravelSplit",
  "projects.travelsplit.desc": "Web app to split and manage group travel expenses with automatic balances, interactive charts, guest mode and login",
  "footer.designedBy": "Designed and developed by",
  "footer.email": "Send email",
  "contact.title": "Contact",
  "contact.text": "Want to collaborate or talk about a project? You can email me directly or connect through social networks.",
  "contact.email": "Email",
  "navbar.home": "Home",
  "navbar.projects": "Projects",
  "navbar.about": "About Me",
  "navbar.contact": "Contact",
  "projects.storeflow.title": "StoreFlow",
  "projects.storeflow.desc": "Backend system for inventory, sales and workshop management, focused on real business rules, transactional integrity and stock consistency.",
  "projects.showMore": "Show more projects",
  "projects.showLess": "Show less"
}