{
    "hero.greeting": "Hi, I'm",
    "hero.name": "Juan Catena",
    "hero.role": "Backend Developer",
    "hero.viewProjects": "View Projects",
    "hero.downloadCV": "Download CV",
    "about.title": "About Me",
    "about.photoAlt": "Photo of Juan Catena - Backend Developer",
    "about.paragraph": "I'm Juan Catena, a Backend Developer and Higher Technician in Cross-Platform Application Development. I have experience in Frontend (React, TailwindCSS, JavaScript) and Backend (Python, Django). I'm motivated by building fast, accessible applications with good development practices. I'm always learning and open to new challenges.",
    "projects.title": "Projects",
    "projects.demo": "Demo",
    "projects.webstihl.title": "Web Stihl",
    "projects.webstihl.desc": "Corporate website developed with Django, Python and TailwindCSS. Deployed to production on Render with a clean and professional design for a real company.",
    "projects.todomotor.title": "Todo Motor",
    "projects.todomotor.desc": "A themed blog about cars and motorcycles built with Django and Bootstrap 5. Includes a post system with categories, search function, admin panel and fully responsive design.",
    "projects.scenra.title": "Scenra App",
    "projects.scenra.desc": "Interactive web app built with React, TypeScript and Vite that allows users to explore movies and series, view trailers, cast, and create custom lists. Inspired by streaming platforms and powered by the TMDB API.",
    "projects.travelsplit.title": "TravelSplit",
    "projects.travelsplit.desc": "Web app to split and manage group travel expenses with automatic balances, interactive charts, guest mode and login",
    "footer.designedBy": "Designed and developed by",
    "footer.email": "Send email",
    "contact.title": "Contact",
    "contact.text": "Want to collaborate or talk about a project? You can email me directly or connect through social networks.",
    "contact.email": "Email",
    "navbar.home": "Home",
    "navbar.projects": "Projects",
    "navbar.about": "About Me",
    "navbar.contact": "Contact"
}