{
    "hero.greeting": "Hola, soy",
    "hero.name": "Juan Catena",
    "hero.role": "Desarrollador Backend",
    "hero.viewProjects": "Ver Proyectos",
    "hero.downloadCV": "Descargar CV",
    "about.title": "Sobre mí",
    "about.photoAlt": "Foto de Juan Catena - Desarrollador Backend",
    "about.paragraph": "Soy Juan Catena, desarrollador backend especializado en Java y Spring Boot. Diseño y construyo APIs, lógica de negocio y sistemas internos que resuelven necesidades reales, desde gestión de inventario y facturación hasta automatización de procesos operativos.Vengo de trabajar con Python y Django en aplicaciones internas de empresa, y actualmente estoy profundizando en arquitectura backend, microservicios, SQL y buenas prácticas para crear proyectos estables, escalables y en producción. Mi objetivo es claro: crecer como backend developer y aportar valor construyendo software que funcione, escale y tenga impacto real.",
    "projects.title": "Proyectos",
    "projects.demo": "Demo",
    "projects.springtrip.title": "SpringTrip — Aplicación Full-Stack (Java + Spring Boot + Next.js)",
    "projects.springtrip.desc": "Aplicación full-stack para la gestión de viajes en grupo y gastos compartidos. Incluye autenticación JWT, control de acceso por usuario, cálculo automático de balances y liquidaciones. Backend en Java 21 con Spring Boot y frontend en Next.js desplegado en producción.",
    "projects.webstihl.title": "Web Stihl",
    "projects.webstihl.desc": "Sitio web corporativo desarrollado con Django, Python y TailwindCSS. Desplegado en producción en Render, con un diseño limpio y profesional para una empresa real.",
    "projects.todomotor.title": "Todo Motor",
    "projects.todomotor.desc": "Blog temático sobre coches y motos construido con Django y Bootstrap 5. Incluye sistema de posts con categorías, buscador, panel de administración y diseño totalmente responsive.",
    "projects.scenra.title": "Scenra App",
    "projects.scenra.desc": "Aplicación web interactiva creada con React, TypeScript y Vite que permite explorar películas y series, ver tráilers, reparto y crear listas personalizadas. Inspirada en plataformas de streaming y alimentada por la API de TMDB.",
    "projects.travelsplit.title": "TravelSplit",
    "projects.travelsplit.desc": "Aplicación web para dividir y gestionar gastos de viaje entre grupos, con balance automático, gráficos interactivos, modo invitado y login",
    "footer.designedBy": "Diseñado y desarrollado por",
    "footer.email": "Enviar correo electrónico",
    "navbar.home": "Inicio",
    "navbar.projects": "Proyectos",
    "navbar.about": "Sobre mí",
    "navbar.contact": "Contacto",
    "contact.title": "Contacto",
    "contact.text": "¿Quieres colaborar o hablar sobre un proyecto? Puedes escribirme directamente o conectar en redes.",
    "contact.email": "Email",
    "projects.storeflow.title": "StoreFlow",
    "projects.storeflow.desc": "Sistema backend para la gestión de inventario, ventas y taller, enfocado en reglas de negocio reales, integridad transaccional y consistencia de stock.",
    "projects.showMore": "Ver más proyectos",
    "projects.showLess": "Ver menos"
}